Revit 2027 API
TemporaryViewModes.RevealHiddenElements Property
 The current state of the RevealHiddenElements mode in the associated view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RevealHiddenElements { get; set; }
Public Property RevealHiddenElements As Boolean
	Get
	Set
public:
property bool RevealHiddenElements {
	bool get ();
	void set (bool value);
}
member RevealHiddenElements : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The RevealHiddenElements mode is either disabled or inapplicable in the associated view.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace